   #                                                  Titanic Exercise 
   #### Practise Pandas

![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)

First of all, import the needed libraries.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
# you will have to import at least two other libraries along the exercise

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [ ]:
filename = "titanic.csv"

In [5]:
titanic=pd.read_csv(filename,sep=",")
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [6]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 107.4+ KB

In [7]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [8]:
titanic.shape

(1309, 14)

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [9]:
people=titanic [["name", "sex", "age"]] #crea un dataframe solo con las columnas que pide en este ejercicio
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [10]:
titanic1= titanic.head(3)
titanic1

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [11]:
titanic2=titanic.tail(4)
titanic2

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [12]:
titanic1.append(titanic2, ignore_index=False)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

4. Slice the row from 3 to 9, call it `s_titanic`

In [53]:
s_titanic=titanic.iloc[3:10,:]
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [58]:
s_titanic_rev=titanic.iloc[::-40,-63::] #preguntar hoy
s_titanic_rev

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN
1268,3,0,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,NaN,NaN,NaN
1228,3,1,"Stranden, Mr. Juho",male,31.00,0,0,STON/O 2. 3101288,7.9250,NaN,S,9,NaN,NaN
1188,3,1,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.00,0,2,PP 9549,16.7000,G6,S,13,NaN,NaN
1148,3,0,"Rintamaki, Mr. Matti",male,35.00,0,0,STON/O 2. 3101273,7.1250,NaN,S,NaN,NaN,NaN
1108,3,0,"Patchett, Mr. George",male,19.00,0,0,358585,14.5000,NaN,S,NaN,NaN,NaN
1068,3,0,"Nysveen, Mr. Johan Hansen",male,61.00,0,0,345364,6.2375,NaN,S,NaN,NaN,NaN
1028,3,1,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q,16,NaN,NaN
988,3,0,"Mahon, Mr. John",male,NaN,0,0,AQ/4 3130,7.7500,NaN,Q,NaN,NaN,NaN
948,3,0,"Lane, Mr. Patrick",male,NaN,0,0,7935,7.7500,NaN,Q,NaN,NaN,NaN
908,3,0,"Jussila, Miss. Mari Aina",female,21.00,1,0,4137,9.8250,NaN,S,NaN,NaN,NaN
868,3,0,"Holm, Mr. John Fredrik Alexander",male,43.00,0,0,C 7075,6.4500,NaN,S,NaN,NaN,NaN
828,3,0,"Goodwin, Miss. Jessie Allis",female,10.00,5,2,CA 2144,46.9000,NaN,S,NaN,NaN,"Wiltshire, England Niagara Falls, NY"
788,3,0,"Ekstrom, Mr. Johan",male,45.00,0,0,347061,6.9750,NaN,S,NaN,NaN,"Effington Rut, SD"
748,3,0,"Danbom, Mr. Ernst Gilbert",male,34.00,1,1,347080,14.4000,NaN,S,NaN,197.0,"Stanton, IA"
708,3,0,"Carlsson, Mr. Carl Robert",male,24.00,0,0,350409,7.8542,NaN,S,NaN,NaN,"Goteborg, Sweden Huntley, IL"
668,3,0,"Barton, Mr. David John",male,22.00,0,0,324669,8.0500,NaN,S,NaN,NaN,"England New York, NY"
628,3,0,"Andersson, Miss. Sigrid Elisabeth",female,11.00,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN"
588,2,1,"Wells, Miss. Joan",female,4.00,1,1,29103,23.0000,NaN,S,14,NaN,"Cornwall / Akron, OH"
548,2,1,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,4,NaN,"Cornwall / Akron, OH"
508,2,0,"Moraweck, Dr. Ernest",male,54.00,0,0,29011,14.0000,NaN,S,NaN,NaN,"Frankfort, KY"
468,2,0,"Karnes, Mrs. J Frank (Claire Bennett)",female,22.00,0,0,F.C.C. 13534,21.0000,NaN,S,NaN,NaN,"India / Pittsburgh, PA"
428,2,1,"Hamalainen, Mrs. William (Anna)",female,24.00,0,2,250649,14.5000,NaN,S,4,NaN,"Detroit, MI"
388,2,1,"Davis, Miss. Mary",female,28.00,0,0,237668,13.0000,NaN,S,13,NaN,"London / Staten Island, NY"
348,2,0,"Bracken, Mr. James H",male,27.00,0,0,220367,13.0000,NaN,S,NaN,NaN,"Lake Arthur, Chavez County, NM"
308,1,1,"White, Mrs. John Stuart (Ella Holmes)",female,55.00,0,0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Briarcliff Manor NY"
268,1,0,"Smith, Mr. Lucien Philip",male,24.00,1,0,13695,60.0000,C31,S,NaN,NaN,"Huntington, WV"
228,1,0,"Penasco y Castellana, Mr. Victor de Satode",male,18.00,1,0,PC 17758,108.9000,C65,C,NaN,NaN,"Madrid, Spain"
188,1,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.00,0,1,PC 17592,39.4000,D28,S,9,NaN,"Paris, France"
148,1,0,"Harris, Mr. Henry Birkhardt",male,45.00,1,0,36973,83.4750,C83,S,NaN,NaN,"New York, NY"
108,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C,4,NaN,NaN
68,1,1,"Chevre, Mr. Paul Romaine",male,45.00,0,0,PC 17594,29.7000,A9,C,7,NaN,"Paris, France"
28,1,1,"Bissette, Miss. Amelia",female,35.00,0,0,PC 17760,135.6333,C99,S,8,NaN,NaN

In [62]:
s_titanic_rev.iloc[1246:1269, :]
s_titanic_rev

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN
1268,3,0,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S,NaN,NaN,NaN
1228,3,1,"Stranden, Mr. Juho",male,31.00,0,0,STON/O 2. 3101288,7.9250,NaN,S,9,NaN,NaN
1188,3,1,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",female,24.00,0,2,PP 9549,16.7000,G6,S,13,NaN,NaN
1148,3,0,"Rintamaki, Mr. Matti",male,35.00,0,0,STON/O 2. 3101273,7.1250,NaN,S,NaN,NaN,NaN
1108,3,0,"Patchett, Mr. George",male,19.00,0,0,358585,14.5000,NaN,S,NaN,NaN,NaN
1068,3,0,"Nysveen, Mr. Johan Hansen",male,61.00,0,0,345364,6.2375,NaN,S,NaN,NaN,NaN
1028,3,1,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q,16,NaN,NaN
988,3,0,"Mahon, Mr. John",male,NaN,0,0,AQ/4 3130,7.7500,NaN,Q,NaN,NaN,NaN
948,3,0,"Lane, Mr. Patrick",male,NaN,0,0,7935,7.7500,NaN,Q,NaN,NaN,NaN
908,3,0,"Jussila, Miss. Mari Aina",female,21.00,1,0,4137,9.8250,NaN,S,NaN,NaN,NaN
868,3,0,"Holm, Mr. John Fredrik Alexander",male,43.00,0,0,C 7075,6.4500,NaN,S,NaN,NaN,NaN
828,3,0,"Goodwin, Miss. Jessie Allis",female,10.00,5,2,CA 2144,46.9000,NaN,S,NaN,NaN,"Wiltshire, England Niagara Falls, NY"
788,3,0,"Ekstrom, Mr. Johan",male,45.00,0,0,347061,6.9750,NaN,S,NaN,NaN,"Effington Rut, SD"
748,3,0,"Danbom, Mr. Ernst Gilbert",male,34.00,1,1,347080,14.4000,NaN,S,NaN,197.0,"Stanton, IA"
708,3,0,"Carlsson, Mr. Carl Robert",male,24.00,0,0,350409,7.8542,NaN,S,NaN,NaN,"Goteborg, Sweden Huntley, IL"
668,3,0,"Barton, Mr. David John",male,22.00,0,0,324669,8.0500,NaN,S,NaN,NaN,"England New York, NY"
628,3,0,"Andersson, Miss. Sigrid Elisabeth",female,11.00,4,2,347082,31.2750,NaN,S,NaN,NaN,"Sweden Winnipeg, MN"
588,2,1,"Wells, Miss. Joan",female,4.00,1,1,29103,23.0000,NaN,S,14,NaN,"Cornwall / Akron, OH"
548,2,1,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S,4,NaN,"Cornwall / Akron, OH"
508,2,0,"Moraweck, Dr. Ernest",male,54.00,0,0,29011,14.0000,NaN,S,NaN,NaN,"Frankfort, KY"
468,2,0,"Karnes, Mrs. J Frank (Claire Bennett)",female,22.00,0,0,F.C.C. 13534,21.0000,NaN,S,NaN,NaN,"India / Pittsburgh, PA"
428,2,1,"Hamalainen, Mrs. William (Anna)",female,24.00,0,2,250649,14.5000,NaN,S,4,NaN,"Detroit, MI"
388,2,1,"Davis, Miss. Mary",female,28.00,0,0,237668,13.0000,NaN,S,13,NaN,"London / Staten Island, NY"
348,2,0,"Bracken, Mr. James H",male,27.00,0,0,220367,13.0000,NaN,S,NaN,NaN,"Lake Arthur, Chavez County, NM"
308,1,1,"White, Mrs. John Stuart (Ella Holmes)",female,55.00,0,0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Briarcliff Manor NY"
268,1,0,"Smith, Mr. Lucien Philip",male,24.00,1,0,13695,60.0000,C31,S,NaN,NaN,"Huntington, WV"
228,1,0,"Penasco y Castellana, Mr. Victor de Satode",male,18.00,1,0,PC 17758,108.9000,C65,C,NaN,NaN,"Madrid, Spain"
188,1,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.00,0,1,PC 17592,39.4000,D28,S,9,NaN,"Paris, France"
148,1,0,"Harris, Mr. Henry Birkhardt",male,45.00,1,0,36973,83.4750,C83,S,NaN,NaN,"New York, NY"
108,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C,4,NaN,NaN
68,1,1,"Chevre, Mr. Paul Romaine",male,45.00,0,0,PC 17594,29.7000,A9,C,7,NaN,"Paris, France"
28,1,1,"Bissette, Miss. Amelia",female,35.00,0,0,PC 17760,135.6333,C99,S,8,NaN,NaN

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [16]:
left_columns=titanic.loc[:,"pclass":"parch"]
left_columns

,pclass,survived,name,sex,age,sibsp,parch
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2
...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [63]:
middle_columns=titanic.drop(["name", "sex", "age"], axis=1)
middle_columns

,pclass,survived,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [18]:
right_columns = titanic.iloc[:, 7::]
right_columns

,ticket,fare,cabin,embarked,boat,body,home.dest
0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,315082,7.8750,NaN,S,NaN,NaN,NaN

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [66]:
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [19]:
max(titanic.age)

80.0

In [20]:
titanic.age[titanic.age==max(titanic.age)] #para sabser tambien el tipo de "age"

14    80.0
Name: age, dtype: float64

In [68]:
titanic.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

In [ ]:
Para dar una respuesta a la segunda pregunta, debe averiguar qué columnas le dan esa información. Por lo general, parte de su trabajo como Científico de Datos será conocer el conjunto de datos con el que está trabajando. En este caso, las columnas que le dan esa información son las siguientes: - 'sibsp' Número de hermanos / cónyuges a bordo - 'parch' Número de padres / hijos a bordo

In [70]:
titanic_prueba= titanic.loc[["sibsp", "parch"]]
titanic_prueba

KeyError: "None of [Index(['sibsp', 'parch'], dtype='object')] are in the [index]"

In [67]:
titanic.iloc[14, :].loc[["sibsp", "parch"]]

sibsp    0
parch    0
Name: 14, dtype: object

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

                                                 name   body embarked
0                       Allen, Miss. Elisabeth Walton    NaN        S
1                      Allison, Master. Hudson Trevor    NaN        S
2                        Allison, Miss. Helen Loraine    NaN        S
3                Allison, Mr. Hudson Joshua Creighton  135.0        S
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    NaN        S
...                                               ...    ...      ...
1304                             Zabour, Miss. Hileni  328.0        C
1305                            Zabour, Miss. Thamine    NaN        C
1306                        Zakarian, Mr. Mapriededer  304.0        C
1307                              Zakarian, Mr. Ortin    NaN        C
1308                               Zimmerman, Mr. Leo    NaN        S

[1309 rows x 3 columns]

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [22]:
cols=titanic.sample(3, random_state=18326, axis=1)
cols

                                                 name   body embarked
0                       Allen, Miss. Elisabeth Walton    NaN        S
1                      Allison, Master. Hudson Trevor    NaN        S
2                        Allison, Miss. Helen Loraine    NaN        S
3                Allison, Mr. Hudson Joshua Creighton  135.0        S
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    NaN        S
...                                               ...    ...      ...
1304                             Zabour, Miss. Hileni  328.0        C
1305                            Zabour, Miss. Thamine    NaN        C
1306                        Zakarian, Mr. Mapriededer  304.0        C
1307                              Zakarian, Mr. Ortin    NaN        C
1308                               Zimmerman, Mr. Leo    NaN        S

[1309 rows x 3 columns]

12. Use both lists `rows` and `cols` to create a new dataframe

In [23]:
new_data=pd.DataFrame(cols)
new_data

                                                 name   body embarked
0                       Allen, Miss. Elisabeth Walton    NaN        S
1                      Allison, Master. Hudson Trevor    NaN        S
2                        Allison, Miss. Helen Loraine    NaN        S
3                Allison, Mr. Hudson Joshua Creighton  135.0        S
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)    NaN        S
...                                               ...    ...      ...
1304                             Zabour, Miss. Hileni  328.0        C
1305                            Zabour, Miss. Thamine    NaN        C
1306                        Zakarian, Mr. Mapriededer  304.0        C
1307                              Zakarian, Mr. Ortin    NaN        C
1308                               Zimmerman, Mr. Leo    NaN        S

[1309 rows x 3 columns]

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

In [24]:
array_fe=titanic["sex"]=="female"
array_fe

0        True
1       False
2        True
3       False
4        True
        ...
1304     True
1305     True
1306    False
1307    False
1308    False
Name: sex, Length: 1309, dtype: bool

Bonus: Rename the column `"sex"` to `"gender"`

In [25]:
titanic.rename(columns={"sex":"gender"})

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

14. Filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [26]:
woman_titanic= titanic[titanic["sex"]]=="female"
woman_titanic

KeyError: "None of [Index(['female', 'male', 'female', 'male', 'female', 'male', 'female', 'male',\n       'female', 'male',\n       ...\n       'male', 'female', 'male', 'male', 'male', 'female', 'female', 'male',\n       'male', 'male'],\n      dtype='object', length=1309)] are in the [columns]"

15. How many woman were younger than 18? Call the variable `minor_wo`

In [27]:
minor_wo=titanic[titanic.age<18]
minor_wo

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.00,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
54,1,1,"Carter, Master. William Thornton II",male,11.00,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
55,1,1,"Carter, Miss. Lucile Polk",female,14.00,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1265,3,0,"Van Impe, Miss. Catharina",female,10.00,0,2,345773,24.1500,NaN,S,NaN,NaN,NaN
1275,3,0,"Vander Planke, Mr. Leo Edmondus",male,16.00,2,0,345764,18.0000,NaN,S,NaN,NaN,NaN
1279,3,0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.00,0,0,350406,7.8542,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.00,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [28]:
titanic_4=titanic.dropna(how="any")
titanic_4

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

In [29]:
#your code

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [30]:
#your code

20. Calculate the ratio of missing values at the `boat` column.

In [31]:
#your code

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` --> `by_class`

In [32]:
#your code

22. Print the maximum age in each class from `by_class`

In [33]:
#your code

23. Print the median fare in each class from `by_class`

In [34]:
#your code

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

In [35]:
#your code

25. Add a new column with the sum of survived men and women, call it `counted['total']`

In [36]:
#your code

26. Sort `counted` by the `'total'` column. In which class the people survived the more?

In [37]:
#your code

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    ¿How many rows fulfill the condition?

In [38]:
#your code

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    ¿How many rows fulfill the condition?

In [39]:
#your code

29. Print the uniques values at the column `'name'`

In [40]:
#your code

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

In [41]:
#your code

31. Using `matplotlib` find the appropriate visualization to show the distribution of the column `'age'`

In [42]:
#your code

32. Using `matplotlib` find the appropriate plot to visualize the column `'gender'`

In [43]:
#your code

32b. What if you also plot the column `'gender'` using the function [`countplot`](https://seaborn.pydata.org/generated/seaborn.countplot.html) from the library [`seaborn`](https://seaborn.pydata.org/)?

Remember you have never used `seaborn` before, therefore you should install it before importing it.

In [44]:
#your code

33. Using the function [`catplot`](https://seaborn.pydata.org/generated/seaborn.catplot.html) from the library `seaborn`, find out if the hypothesis _"Women are more likely to survive shipwrecks"_ is true or not.

You should get something like this:

![catplot](catplotgen.png)

In [45]:
#your code

34. Using [`kdeplot`]("https://seaborn.pydata.org/generated/seaborn.kdeplot.html") from `seaborn` represent those who not survived distributed by age.

Hint: First you should "filter" the `titanic` dataset where the column "survived" is 0, indexing the column `"age"` only.

Arguments you should pass to the function: 

    - color = "red"
    - label = "Not Survived"
    - shade = True
    
You should get something like this:

![kdeplot](kdeplotsur.png)

In [46]:
#your code